// [艦名，艦種，Tier，HP，主砲口径，主砲射程，主砲火災発生率，副砲射程，副砲火災発生率，
//  魚雷射程，魚雷装填速度，最長対空砲距離，最長対空砲秒間平均ダメージ，最大速度，
//  転舵所要時間，海面各県距離，航空発見距離]
// ["艦名",  "艦種",  Tier,  HP,  主砲口径,  主砲射程,  主砲火災発生率,  副砲射程,  副砲火災発生率,  魚雷射程,魚雷速度,
//  魚雷装填速度,  最長対空砲距離,  最長対空砲秒間平均ダメージ,  最大速度,  転舵所要時間,  海面各県距離,  航空発見距離],
var shipdata = [
    ["Hashidate", "巡洋艦", 1, 5150, 120, 9.1, 9, 0, 0, 0, 0,0, 4.5, 1, 19.5, 3, 7.7, 4.7],
    ["Chikuma", "巡洋艦", 2, 18700, 152, 10.3, 13, 3.5, 5, 0, 0, 0, 0.9, 2, 26.4, 5, 9.2, 5.2],
    ["Tenryu", "巡洋艦", 3, 17700, 140, 12.4, 12, 0, 0, 7.0, 58, 57, 3.0, 3, 33.2, 5.2, 8.3, 4.8],
    ["Kuma", "巡洋艦", 4, 24000, 140, 12.8, 10, 0, 0, 8, 57, 42, 3.0, 12, 34.7, 7.0, 11.3, 6.5],
    ["Furutaka",  "巡洋艦",  5,  30700,  203,  13.9,  17,  4.0,  8,  10, 59, 94, 4.5, 20, 34.5,  5.7,  12.6,  7.0],
    ["Aoba", "巡洋艦", 6, 31700, 203, 14.9, 17, 4.5, 8, 10, 59, 102, 4.5, 20, 35, 6.5, 12.1, 7.0],
    ["Myoko", "巡洋艦", 7, 39200, 20.3, 15.6, 17, 4.5, 8, 10, 62, 76, 5.0, 40, 35.0, 7.1, 13.1, 8.2],
    ["Mogami", "巡洋艦", 8, 39100, 155, 15,7, 10, 5.0, 10, 62, 109, 5.0, 50, 34.5, 7.1, 12.1, 8.5],
    ["Ibuki", "巡洋艦", 9, 39000, 203, 16.5, 17, 5.0, 6, 10, 67, 120, 5.0, 83, 35.0, 7.3, 12.6, 8.5],
    ["Zao", "巡洋艦", 10, 40800, 203, 16.2, 19, 4.5, 6, 8, 76, 141, 5.0, 125, 34.5, 7.7, 12.6, 9.3],
    ["Katori", "巡洋艦", 3, 22000, 140, 13.5, 10, 3.5, 8, 7.0,57,39.0, 5.0, 10, 18.0, 6.5, 11.0, 5.5],
    ["Yubari", "巡洋艦", 4, 18300, 140, 12.8, 10, 2.0, 8, 6.0, 49, 63, 4.5, 3, 34.5, 3.8, 9.9, 4.7],
    ["Atago", "巡洋艦", 8, 40100, 203, 15.8, 17, 5.5, 8, 10, 62, 101, 5.0, 40, 35.5, 8.1, 11.9, 8.7],
    //ここまで日巡
    ["Umikaze", "駆逐艦", 2, 10300, 120, 8.0, 8, 0, 0, 8.0, 48, 24, 2.0, 11, 33, 2.7, 5.6, 2.9],
    ["Wakatake", "駆逐艦", 3, 8200, 120, 9.4, 8, 0, 0, 7.0, 57, 42, 2.0, 6, 35.5, 2.7, 6.1, 2.5],
    ["Isokaze", "駆逐艦", 4, 10300, 120, 10.7, 7, 0, 0, 7.0, 57, 42, 2.0, 11, 34, 2.7, 6.1, 2.8],
    ["Mutsuki", "駆逐艦", 5, 11300, 120, 8.9, 7, 0, 0, 8.0, 63, 73, 5.0, 6, 37.5, 2.1, 6.2, 3.1],
    ["Minekaze", "駆逐艦", 5, 10900, 120, 8.9, 7, 0, 0, 7.0, 57, 42, 3.1, 5, 39, 2.1, 6.2, 3.1],
    ["Fubuki", "駆逐艦", 6, 12900, 127, 11.5, 7, 0, 0, 10, 59, 76, 3.1, 24, 35.0, 2.5, 7.0, 3.8],
    ["Hatsuharu", "駆逐艦", 6, 11700, 127, 10.8, 7, 0, 0, 10, 59, 76, 5.0, 20, 36.5, 2.3, 6.7, 3.5],
    ["Akatsuki", "駆逐艦", 7, 13100, 127, 10.4, 7, 0, 0, 10, 62, 76, 5.0, 30, 38.0, 3.2, 7.4, 3.8],
    ["Shiratsuyu", "駆逐艦", 7, 12800, 127, 11.0, 7, 0, 0, 10, 62, 101, 3.1, 40, 34.0, 3.1, 6.7, 3.5],
    ["Kagero", "駆逐艦", 8, 15100, 127, 9.4, 7, 0, 0, 10, 67, 112, 3.1, 18, 35.0, 2.7, 6.8, 3.8],
    ["Akizuki", "駆逐艦", 8, 20400, 100, 12.5, 5, 0, 0, 10, 67, 112, 5.0, 83, 33.0, 4.6, 7.6, 4.4],
    ["Yugumo", "駆逐艦", 9, 15500, 127, 12.0, 7, 0, 0, 12.0, 67, 114, 5.0, 30, 35.5, 3.6, 7.0, 3.9],
    ["Shimakaze", "駆逐艦", 10, 17900, 127, 11.4, 7, 0, 0, 12.0, 67, 153, 5.0, 30, 39.0, 3.0, 7.6, 4.2],
    ["Tachibana", "駆逐艦", 2, 7000, 76, 8.0, 6, 0, 0, 4.0, 44, 22, 0, 0, 30, 1.9, 5.4, 2.3],
    ["Kamikaze", "駆逐艦", 5, 11100, 120, 8.7, 8, 0, 0, 7.0, 68, 47, 1.0, 3, 37.5, 2.9, 6.2, 3.1],
    ["Shinonome", "駆逐艦", 6, 12900, 127, 9.0, 7, 0, 0, 8.0, 62, 73, 1.2, 4, 35.0, 3.2, 7.0, 3.8],
    ["Harekaze", "駆逐艦", 8, 13300, 100, 9.4, 5, 0, 0, 10, 62, 101, 5.0, 62, 35.5, 4.0, 6.8, 3.8],
    //ここまで日駆

    // ["Kawachi", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Myogi", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Kongo", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Fuso", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Nagato", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Amagi", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Izumo", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Yamato", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Mikasa", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Ishizuchi", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Mutsu", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Ashitaka", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Kii", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Musashi", "戦艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    //日戦ここまで

    // ["Hosho", "空母", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Zuiho", "空母", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Ryujo", "空母", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Hiryu", "空母", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Shokaku", "空母", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Taiho", "空母", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Hakuryu", "空母", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Kaga", "空母", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    //日空ここまで

    // ["Ryujo", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Hiryu", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Shokaku", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Taiho", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Hosho", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Zuiho", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Ryujo", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Hiryu", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Shokaku", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Taiho", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Hosho", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Zuiho", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Ryujo", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Hiryu", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Shokaku", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    // ["Taiho", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程, 魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],
    

];

var jptype = new Array(
    "","駆逐艦","巡洋艦","戦艦","空母"
);
var ustype = new Array(
    "","駆逐艦","巡洋艦","戦艦","空母",
);
var kmtype = new Array(
    "","駆逐艦","巡洋艦","戦艦","空母",
);
var rutype = new Array(
    "","駆逐艦","巡洋艦","戦艦","",
);
var uktype = new Array(
    "","駆逐艦","巡洋艦","戦艦","",
);
var frtype = new Array(
    "","駆逐艦","巡洋艦","戦艦","",
);
var patype = new Array(
    "","駆逐艦","巡洋艦","","",
);
var potype = new Array(
    "","駆逐艦","","","",
);
var etctype = new Array(
    "","駆逐艦","巡洋艦","戦艦","",
);


// var jpca = [
//     ["Hashidate", "巡洋艦", 1, 5150, 120, 9.1, 9, 0, 0, 0, 0,0, 4.5, 1, 19.5, 3, 7.7, 4.7],
//     ["Chikuma", "巡洋艦", 2, 18700, 152, 10.3, 13, 3.5, 5, 0, 0, 0, 0.9, 2, 26.4, 5, 9.2, 5.2],
//     ["Tenryu", "巡洋艦", 3, 17700, 140, 12.4, 12, 0, 0, 7.0, 58, 57, 3.0, 3, 33.2, 5.2, 8.3, 4.8],
//     ["Kuma", "巡洋艦", 4, 24000, 140, 12.8, 10, 0, 0, 8, 57, 42, 3.0, 12, 34.7, 7.0, 11.3, 6.5],
//     ["Furutaka",  "巡洋艦",  5,  30700,  203,  13.9,  17,  4.0,  8,  10, 59, 94, 4.5, 20, 34.5,  5.7,  12.6,  7.0],
//     ["Aoba", "巡洋艦", 6, 31700, 203, 14.9, 17, 4.5, 8, 10, 59, 102, 4.5, 20, 35, 6.5, 12.1, 7.0],
//     ["Myoko", "巡洋艦", 7, 39200, 20.3, 15.6, 17, 4.5, 8, 10, 62, 76, 5.0, 40, 35.0, 7.1, 13.1, 8.2],
//     ["Mogami", "巡洋艦", 8, 39100, 155, 15,7, 10, 5.0, 8, 10, 62, 109, 5.0, 50, 34.5, 7.1, 12.1, 8.5],
//     ["Ibuki", "巡洋艦", 9, 39000, 203, 16.5, 17, 5.0, 6, 10, 67, 120, 5.0, 83, 35.0, 7.3, 12.6, 8.5],
//     ["Zao", "巡洋艦", 10, 40800, 203, 16.2, 19, 4.5, 6, 8, 76, 141, 5.0, 125, 34.5, 7.7, 12.6, 9.3],
//     // ["艦名", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程,魚雷速度,
//     //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],

// ];




var jpdd = [
    "","Umikaze","Wakatake","Isokaze","Minekaze","Mutsuki","Fubuki","Hatsuharu","Akatsuki","Shiratsuyu","Kagero","Akizuki","Yugumo","Shimakaze","Tachibana","Kamikaze","Shinonome","Harekaze","","","",""
];

var jpca = [
    "","Hashidate","Chikuma","Tenryu","Kuma","Furutaka","Aoba","Myoko","Mogami","Ibuki","Zao","Katori","Iwakialpha","Yubari","Atago"
];

var jpbb = [
    "","Kawachi","Myogi","Kongo","Fuso","Nagato","Amagi","Izumo","Yamato","Mikasa","Ishizuchi","Mutsu","Ashitaka","Kii","Musahsi"
];

var jpcv = [
    "","Hosho","Zuiho","Ryujo","Hiryu","Shokaku","Taiho","Hakuryu","Kaga"
];

var usdd = [
    "","Sampson","Wickes","Clemson","Nicholas","Farragut","Mahan","Benson","Fletcher","Gearing","Smith","Sims","Kidd","Black","","","","","","","","",
];

var usca = [
    "","Erie","Chester","St.Louis","Phoenix","Omaha","Cleveland","Pensacola","New Orlans","Baltimore","Des Moines","Albany","Marblehead","Atlanta","Indianapolis","Frint","","","","","","",
];

var usbb = [
    "","South Carolina","Wyoming","New York","New Mexico","Colorado","North Carolina","Iowa","Montana","Arkansas beta","Texas","Arizona","Alabama","","","","","","","","","",
];

var uscv = [
    "","Langley","Bogue","Independence","Ranger","Lexington","Essex","Midway","Saipan","Enterprise","","","","","","","","","","","","",
];

var kmdd = [
    "", "V-25", "G-101", "V-170", "T-22", "Ernst Gaede", "Leberecht Maass", "Z-23", "Z-46", "Z-52", "Z-39", "", "", "", "", "", "", "", "", "", "", "",
];

var kmca = [
    "", "Hermelin", "Dresden", "Korberg", "Karlsruhe", "Königsberg", "Nürnberg", "Yorck", "Admiral Hipper", "Roon", "Hindenburg", "Emden", "Admiral Graf Spee", "Prinz Eugen", "", "", "", "", "", "", "", "",
];

var kmbb = [
    "", "Nassau", "Kaiser", "König", "Bayern", "Gneisenau", "Bismarck", "Friedrich Der Große", "Großer Kurfürst", "König Albert", "Scharnhorst", "Tirpitz", "", "", "", "", "", "", "", "", "", "",
];

var kmcv = [
    "", "Graf Zeppelin", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
];

var rudd = [
    "", "Storozhevoi", "Derzki", "Izyaslav", "Podvoisky", "Gnevny", "Minsk", "Kiev", "Ognevoi", "Tashkent", "Udaloi", "Khabarovsk", "Grozovoi", "Gremyashchy", "Okhotnik", "Leningrad", "", "", "", "", "", "",
];

var ruca = [
    "", "Orlan", "Novik", "Bogatyr", "Svietlana", "Kirov", "Budyonny", "Shchors", "Chapayev", "Dmitri Donskoi", "Moskva", "Diana", "Aurora", "Oleg", "Murmansk", "Krasny Krym", "Molotov", "Admiral Makarov", "Mikhail Kutuzov", "", "", "",
];

var rubb = [
    "", "Imperator Nikolai I", "Oktyabrskaya Revolutsiya", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
];

var eudd = [
    "", "Campbeltown", "Gallant", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
];

var euca = [
    "", "Black Swan", "Weymouth	", "Caledon", "Danae", "Emerald", "Leander", "Fiji", "Edinburgh", "Neptune", "Minotaur", "Belfast", "", "", "", "", "", "", "", "", "", "",
];

var eubb = [
    "", "Bellerophon", "Orion", "Iron Duke", "Queen Elizabeth", "King George V", "Monarch", "Lion", "Conqueror", "Warspite", "Hood", "Duke of York", "Nelson", "", "", "", "", "", "", "", "", "",
];

var frdd = [
    "", "Aigle", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
];

var frca = [
    "", "Bougainville", "Jurien de la Gravière", "Friant", "Duguay-Trouin", "Émile Bertin", "La Galissonnière", "Algérie", "Charles Martel", "Saint-Louis", "Henri IV", "De Grasse", "", "", "", "", "", "", "", "", "", "",
];

var frbb = [
    "", "Turenne", "Courbet", "Bretagne", "Normandie", "Lyon", "Richelieu", "Alsace", "République", "Dunkerque", "Gascogne", "", "", "", "", "", "", "", "", "", "", "",
];

var padd = [
    "", "Long Jiang", "Phra Ruang", "Shen Yang", "Jian Wei", "Fu Shun", "Gadjah Madah", "Hsien Yang", "Chung Mu", "Yueyang", "Anshan", "Lo Yang", "", "", "", "", "", "", "", "", "", "",
];

var paca = [
    "", "Cheng An", "Huang He", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
];

var podd = [
    "", "Błyskawica", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
];

var etc = [
    "", "Vampire", "Perth", "Giulio Cesare", "Duca d'Aosta", "Roma", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "",
];



