// [艦名，艦種，Tier，HP，主砲口径，主砲射程，主砲火災発生率，副砲射程，副砲火災発生率，
//  魚雷射程，魚雷装填速度，最長対空砲距離，最長対空砲秒間平均ダメージ，最大速度，
//  転舵所要時間，海面各県距離，航空発見距離]
// ["艦名",  "艦種",  Tier,  HP,  主砲口径,  主砲射程,  主砲火災発生率,  副砲射程,  副砲火災発生率,  魚雷射程,魚雷速度,
//  魚雷装填速度,  最長対空砲距離,  最長対空砲秒間平均ダメージ,  最大速度,  転舵所要時間,  海面各県距離,  航空発見距離],
var shipdata = [
    ["Hashidate", "巡洋艦", 1, 5150, 120, 9.1, 9, 0, 0, 0, 0,0, 4.5, 1, 19.5, 3, 7.7, 4.7],
    ["Chikuma", "巡洋艦", 2, 18700, 152, 10.3, 13, 3.5, 5, 0, 0, 0, 0.9, 2, 26.4, 5, 9.2, 5.2],
    ["Tenryu", "巡洋艦", 3, 17700, 140, 12.4, 12, 0, 0, 7.0, 58, 57, 3.0, 3, 33.2, 5.2, 8.3, 4.8],
    ["Kuma", "巡洋艦", 4, 24000, 140, 12.8, 10, 0, 0, 8, 57, 42, 3.0, 12, 34.7, 7.0, 11.3, 6.5],
    ["Furutaka",  "巡洋艦",  5,  30700,  203,  13.9,  17,  4.0,  8,  10, 59, 94, 4.5, 20, 34.5,  5.7,  12.6,  7.0],
    ["Aoba", "巡洋艦", 6, 31700, 203, 14.9, 17, 4.5, 8, 10, 59, 102, 4.5, 20, 35, 6.5, 12.1, 7.0],
    ["Myoko", "巡洋艦", 7, 39200, 20.3, 15.6, 17, 4.5, 8, 10, 62, 76, 5.0, 40, 35.0, 7.1, 13.1, 8.2],
    ["Mogami", "巡洋艦", 8, 39100, 155, 15,7, 10, 5.0, 8, 10, 62, 109, 5.0, 50, 34.5, 7.1, 12.1, 8.5],
    ["Ibuki", "巡洋艦", 9, 39000, 203, 16.5, 17, 5.0, 6, 10, 67, 120, 5.0, 83, 35.0, 7.3, 12.6, 8.5],
    ["Zao", "巡洋艦", 10, 40800, 203, 16.2, 19, 4.5, 6, 8, 76, 141, 5.0, 125, 34.5, 7.7, 12.6, 9.3],
    // ["艦名", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程,魚雷速度,
    //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],

];

var jptype = new Array(
    "","駆逐艦","巡洋艦","戦艦","空母"
);
var ustype = new Array(
    "","駆逐艦","巡洋艦","戦艦","空母",
);
var kmtype = new Array(
    "","駆逐艦","巡洋艦","戦艦","空母",
);
var rutype = new Array(
    "","駆逐艦","巡洋艦","戦艦","",
);
var uktype = new Array(
    "","駆逐艦","巡洋艦","戦艦","",
);
var frtype = new Array(
    "","駆逐艦","巡洋艦","戦艦","",
);
var patype = new Array(
    "","駆逐艦","巡洋艦","","",
);
var potype = new Array(
    "","駆逐艦","","","",
);
var etctype = new Array(
    "","駆逐艦","巡洋艦","戦艦","",
);


// var jpca = [
//     ["Hashidate", "巡洋艦", 1, 5150, 120, 9.1, 9, 0, 0, 0, 0,0, 4.5, 1, 19.5, 3, 7.7, 4.7],
//     ["Chikuma", "巡洋艦", 2, 18700, 152, 10.3, 13, 3.5, 5, 0, 0, 0, 0.9, 2, 26.4, 5, 9.2, 5.2],
//     ["Tenryu", "巡洋艦", 3, 17700, 140, 12.4, 12, 0, 0, 7.0, 58, 57, 3.0, 3, 33.2, 5.2, 8.3, 4.8],
//     ["Kuma", "巡洋艦", 4, 24000, 140, 12.8, 10, 0, 0, 8, 57, 42, 3.0, 12, 34.7, 7.0, 11.3, 6.5],
//     ["Furutaka",  "巡洋艦",  5,  30700,  203,  13.9,  17,  4.0,  8,  10, 59, 94, 4.5, 20, 34.5,  5.7,  12.6,  7.0],
//     ["Aoba", "巡洋艦", 6, 31700, 203, 14.9, 17, 4.5, 8, 10, 59, 102, 4.5, 20, 35, 6.5, 12.1, 7.0],
//     ["Myoko", "巡洋艦", 7, 39200, 20.3, 15.6, 17, 4.5, 8, 10, 62, 76, 5.0, 40, 35.0, 7.1, 13.1, 8.2],
//     ["Mogami", "巡洋艦", 8, 39100, 155, 15,7, 10, 5.0, 8, 10, 62, 109, 5.0, 50, 34.5, 7.1, 12.1, 8.5],
//     ["Ibuki", "巡洋艦", 9, 39000, 203, 16.5, 17, 5.0, 6, 10, 67, 120, 5.0, 83, 35.0, 7.3, 12.6, 8.5],
//     ["Zao", "巡洋艦", 10, 40800, 203, 16.2, 19, 4.5, 6, 8, 76, 141, 5.0, 125, 34.5, 7.7, 12.6, 9.3],
//     // ["艦名", "巡洋艦", Tier, HP, 主砲口径, 主砲射程, 主砲火災発生率, 副砲射程, 副砲火災発生率, 魚雷射程,魚雷速度,
//     //     魚雷装填速度, 最長対空砲距離, 最長対空砲秒間平均ダメージ, 最大速度, 転舵所要時間, 海面各県距離, 航空発見距離],

// ];




var jpdd = [
    "","Umikaze","Wakatake"
];

var jpca = [
    "","Hashidate","Chikuma","Tenryu","Kuma","Furutaka","Aoba","Myoko","Mogami","Ibuki","Zao","","",""
];

var jpbb = [
    "","Kawachi","Myogi","Kongo","Fuso","Nagato","Amagi","Izumo","Yamato","Mikasa","Ishizuchi"
];

var jpcv = [
    "","Hosho","Zuiho","Ryujo","Hiryu","Shokaku","Taiho","Hakuryu"
];